In [ ]:
dataframe hakkında bilgi edinme 

    1- head() varsayılan olarak ilk 5 satır gösterir
    2- tail() varsayılan olarak son 5 satır gösterir.
    3- columns sütunların ismini verir.
    4- axes index ve data type bilgisini verir.
    5- shape DataFrame satır sütun bilgisini verir.
    6- ndim DataFrame boyut bilgisini verir.
    7- size DataFrame eleman sayısını verir.
    8- values DataFrame eleman değerini verir
    9- info() veri seti hakkında genel bilgi verir.
    10- describe() verilerin dağılımı hakkında genel bilgi verir.
    11- unique veris setindeki eşsiz değeri verir.
    12- nunique veri setindeki eşsiz değer sayısını verir.
    13- value_counts() veri setindeki değerlerin sayısını verir.

In [8]:
import pandas as pd
import numpy as np


sayılistesi = np.random.randint(1,50,30)
sayılistesi

sayılist= np.reshape(sayılistesi,(6,5))
sayılist

df4 = pd.DataFrame(sayılist,columns=["s1","s2","s3","s4","s5"])
df4

   s1  s2  s3  s4  s5
0  47  30  14  49   4
1   2  39  30   4  24
2  24  40  24  39   7
3  48   8  22  22  18
4  21   3  46  37  36
5  30  25  27  13   5

In [11]:
df4.head()

   s1  s2  s3  s4  s5
0  47  30  14  49   4
1   2  39  30   4  24
2  24  40  24  39   7
3  48   8  22  22  18
4  21   3  46  37  36

In [13]:
df4.tail()

   s1  s2  s3  s4  s5
1   2  39  30   4  24
2  24  40  24  39   7
3  48   8  22  22  18
4  21   3  46  37  36
5  30  25  27  13   5

In [15]:
df4.columns

Index(['s1', 's2', 's3', 's4', 's5'], dtype='object')

In [16]:
df4.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['s1', 's2', 's3', 's4', 's5'], dtype='object')]

In [17]:
df4.shape

(6, 5)

In [18]:
df4.ndim

2

In [19]:
df4.size

30

In [20]:
df4.values

array([[47, 30, 14, 49,  4],
       [ 2, 39, 30,  4, 24],
       [24, 40, 24, 39,  7],
       [48,  8, 22, 22, 18],
       [21,  3, 46, 37, 36],
       [30, 25, 27, 13,  5]])

In [22]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   s1      6 non-null      int32
 1   s2      6 non-null      int32
 2   s3      6 non-null      int32
 3   s4      6 non-null      int32
 4   s5      6 non-null      int32
dtypes: int32(5)
memory usage: 252.0 bytes

In [23]:
df4.describe()

              s1         s2         s3         s4         s5
count   6.000000   6.000000   6.000000   6.000000   6.000000
mean   28.666667  24.166667  27.166667  27.333333  15.666667
std    17.339742  15.587388  10.703582  17.189144  12.754084
min     2.000000   3.000000  14.000000   4.000000   4.000000
25%    21.750000  12.250000  22.500000  15.250000   5.500000
50%    27.000000  27.500000  25.500000  29.500000  12.500000
75%    42.750000  36.750000  29.250000  38.500000  22.500000
max    48.000000  40.000000  46.000000  49.000000  36.000000

In [26]:
df4["s2"].unique()

array([30, 39, 40,  8,  3, 25])

In [27]:
df4["s2"].nunique()

6

In [29]:
df4["s2"].value_counts()

s2
30    1
39    1
40    1
8     1
3     1
25    1
Name: count, dtype: int64